tutorials/2206/alkaWEFoam/multiLayerBuild/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //




defaultFieldValues
(
    //volScalarFieldValue sigma_s 1000
    volScalarFieldValue Ne 0
    volScalarFieldValue Pe 0
    volScalarFieldValue Mem 0
    volScalarFieldValue eps 0.95
    volScalarFieldValue	tau 1.2
    volScalarFieldValue PeC 0
    volScalarFieldValue NeC 0
    volScalarFieldValue as 1e-5
    volScalarFieldValue slopeGrowth 2
    volScalarFieldValue thetaScale 1
    volScalarFieldValue hf 0
    volScalarFieldValue rb 0.06e-3
    volScalarFieldValue K 1e6
    volScalarFieldValue Kr 1
    volScalarFieldValue wr 1e-6
    
);

regions
(
    zoneToCell
    {
    	zone     positiveChannel;
    	
    	fieldValues
    	(
    		volScalarFieldValue PeC 1
    		volScalarFieldValue eps 0.999
    		volScalarFieldValue	tau 1
    		
    		
    		
    	);
    }
    zoneToCell
    {
    	zone     negativeChannel;
    	
    	fieldValues
    	(
    		volScalarFieldValue NeC 1
    		volScalarFieldValue eps 0.999
    		volScalarFieldValue	tau 1
    		
    	);
    }
        zoneToCell
    {
    	zone     positiveElectrode;
    	
    	fieldValues
    	(
    	    volScalarFieldValue eps 0.95
    		volScalarFieldValue as 4800
    		volScalarFieldValue rb 0.075e-3
    		volScalarFieldValue slopeGrowth 5
    		volScalarFieldValue thetaScale 5
    		volScalarFieldValue hf 0.5
    		volScalarFieldValue Pe 1
    		volScalarFieldValue K 1e-9
    		volScalarFieldValue Kr 1.7
    		volScalarFieldValue wr 0.03e-3
    	);
    }
    zoneToCell
    {
    	zone     negativeElectrode;
    	
    	fieldValues
    	(
    	    volScalarFieldValue eps 0.95
    		volScalarFieldValue as 4800
    		volScalarFieldValue rb 0.05e-3
    		volScalarFieldValue slopeGrowth 5
    		volScalarFieldValue thetaScale 2
    		volScalarFieldValue hf 0.5
    		volScalarFieldValue Ne 1
    		volScalarFieldValue K 1e-9
    		volScalarFieldValue Kr 1.7
    		volScalarFieldValue wr 0.03e-3
    	);
    }
    zoneToCell
    {
    	zone     positiveElectrode2;
    	
    	fieldValues
    	(
    	    volScalarFieldValue eps 0.98
    		volScalarFieldValue as 4000
    		volScalarFieldValue rb 0.08e-3
    		volScalarFieldValue slopeGrowth 4
    		volScalarFieldValue thetaScale 3
    		volScalarFieldValue hf 0.2
    		volScalarFieldValue Pe 1
    		volScalarFieldValue K 1e-8
    		volScalarFieldValue Kr 1.4
    		volScalarFieldValue wr 0.05e-3
    	);
    }
    zoneToCell
    {
    	zone     negativeElectrode2;
    	
    	fieldValues
    	(
    	    volScalarFieldValue eps 0.98
    		volScalarFieldValue as 4000
    		volScalarFieldValue rb 0.06e-3
    		volScalarFieldValue slopeGrowth 4
    		volScalarFieldValue thetaScale 1
    		volScalarFieldValue hf 0.2
    		volScalarFieldValue Ne 1
    		volScalarFieldValue K 1e-8
    		volScalarFieldValue Kr 1.4
    		volScalarFieldValue wr 0.05e-3
    	);
    }
    
    zoneToCell
    {
    	zone     diaphram;
    	
    	fieldValues
    	(
    		volScalarFieldValue eps 0.5
    		volScalarFieldValue tau 2.7
    		volScalarFieldValue Mem 1
    		volScalarFieldValue K 1e-18
    		volScalarFieldValue Kr 3
    	);
    }
);


// ************************************************************************* //
